#!/usr/bin/env python
# coding=utf-8

import flask_config
from flask import json


@flask_config.app.route('/search', methods=['GET', 'POST'])
def search():
    data = [{'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'},
            {'姓名': 'xx', '学号': 1234, '性别': 'male', '联系方式': '29xxx'}]
    return json.dumps(data, encoding='utf-8')
